# TilePatternFamrefComponentExtents Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TilePatternFamrefComponentExtents Property
ParameterTypeId Class See Also
---
"Component Extents"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TilePatternFamrefComponentExtents { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TilePatternFamrefComponentExtents As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TilePatternFamrefComponentExtents {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace